---
kind: property
id: P:Autodesk.Revit.DB.LevelAssociationData.IsValidObject
source: html/bdc0b45d-d0f8-a459-b271-c3f212390d47.htm
---
# Autodesk.Revit.DB.LevelAssociationData.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.